Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_SPLIT_TARGET
The user property field type is rebar split target.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_STAGGER_TYPE
The user property field type is rebar stagger type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_LAPPING_SIDE
The user property field type is rebar lapping side.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_LAPPING_OFFSET_DIRECTION
The user property field type is rebar lapping offset direction.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_LAPPING_OFFSET_TYPE
The user property field type is rebar lapping offset type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DISTANCE_LIST_TOTAL
The user property field type is distance list total.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_LENGTH_ADJUSTMENT_TYPE
The user property field type is rebar length adjustment type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_SHAPE
The user property field type is shape.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_PLAIN_HOLE_TYPE
The user property field type is plain hole type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_MASS_FLOW
The user property field type is mass flow.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_VOLUME_FLOW
The user property field type is volume flow.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_HEAT_CAPACITY
The user property field type is heat capacity.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_PRESSURE_LOSS
The user property field type is pressure loss.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_VELOCITY
The user property field type is velocity.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_FLOW_COEFFICIENT
The user property field type is flow coefficient.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DYNAMIC_VISCOSITY
The user property field type is dynamic viscosity.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_KINEMATIC_VISCOSITY
The user property field type is kinematic viscosity.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_POWER
The user property field type is power.